// Версия 1.00.08
// 05.12.2025 Добавлен выбор договора.
// 03.12.2024 Коментарий заменен на номер накладной
// 02.12.2024 Переделано примечание документа
// 20.11.2023 Добавлена вкладка дополнительных настроек
// 16.10.2023 Документ сохраняется не проведенным, добавлен признак Нал\Безнал
// 09.10.2023 Пройдена обработка данных 

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем Версия Экспорт;
Перем СтавкаНДС;
Перем СтавкаНСП; 


    
Процедура ГрузитьИзТекста()
	стрФильтр = "Файл загрузки Csv (*.csv)|*.csv";
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);	
	ДиалогВыбора.Фильтр = стрФильтр;
	ДиалогВыбора.Заголовок = "Выберите файл загрузки";
	ДиалогВыбора.МножественныйВыбор = Ложь;
	ДиалогВыбора.ПредварительныйПросмотр = Ложь;
	ДиалогВыбора.ПроверятьСуществованиеФайла = Истина;
	
	Если ДиалогВыбора.Выбрать() Тогда
		ФайлЗагрузки = ДиалогВыбора.ПолноеИмяФайла;	
	Иначе
		ФайлЗагрузки = "";
		Возврат;
	КонецЕсли;
	
	Разделитель=";";
	ТаблицаЗагрузки.Очистить(); 
	// чтение
	ЗагружаемыйФайл = Новый ТекстовыйДокумент;
	ЗагружаемыйФайл.Прочитать(ФайлЗагрузки,КодировкаТекста.ANSI); 
	
	Для НомерСтроки=2 по ЗагружаемыйФайл.КоличествоСтрок() Цикл

		// получить стрoку с указанным номером и преобразуем её в массив
		Строка = ЗагружаемыйФайл.ПолучитьСтроку(НомерСтроки);
		МассивЗн = СтрРазделить(Строка,Разделитель,Истина);// процедура из типовой конфигурации, разбивает строку в массив по разделителям
		СтрокаЗагрузки= ТаблицаЗагрузки.Добавить();
        СтрокаЗагрузки.НомерПорядковый = СокрЛП(МассивЗн[0]);
        СтрокаЗагрузки.НомерНакладной = СокрЛП(МассивЗн[1]);
		СтрокаЗагрузки.Дата = МассивЗн[2];
		СтрокаЗагрузки.Клиент = МассивЗн[3];
		СтрокаЗагрузки.РННКлиента = МассивЗн[4];
		Если ПустаяСтрока(СтрокаЗагрузки.РННКлиента) Тогда
			СтрокаЗагрузки.РННКлиента="-";	
		КонецЕсли;
		СтрокаЗагрузки.ПинКодТМЦ = МассивЗн[5];
		СтрокаЗагрузки.Наименование = МассивЗн[6];
		СтрокаЗагрузки.ЕдИзм = МассивЗн[7];
		СтрокаЗагрузки.Количество = ПривестиСтрокуКЧислу(МассивЗн[8]);
		СтрокаЗагрузки.Цена = ПривестиСтрокуКЧислу(МассивЗн[9]);
		СтрокаЗагрузки.Адрес = МассивЗн[10];
		СтрокаЗагрузки.Примечание = МассивЗн[11];
		СтрокаЗагрузки.ЗаНал = МассивЗн[12];
		СтрокаЗагрузки.Списание = МассивЗн[13];
		СтрокаЗагрузки.Машина = МассивЗн[14];
		СтрокаЗагрузки.Отвественный = МассивЗн[15];

	
	КонецЦикла;
	
	ЗаполнитьТаблицуСопоставлениеми();
КонецПроцедуры     

Процедура ГрузитьИзExcel() Экспорт   
               стрФильтр = "Файл загрузки Excel (*.xlsx)|*.xlsx";
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);	
	ДиалогВыбора.Фильтр = стрФильтр;
	ДиалогВыбора.Заголовок = "Выберите файл загрузки Excel";
	ДиалогВыбора.МножественныйВыбор = Ложь;
	ДиалогВыбора.ПредварительныйПросмотр = Ложь;
	ДиалогВыбора.ПроверятьСуществованиеФайла = Истина;
	
	Если ДиалогВыбора.Выбрать() Тогда
		ФайлЗагрузки = ДиалогВыбора.ПолноеИмяФайла;	
	Иначе
		ФайлЗагрузки = "";
		Возврат;
	КонецЕсли;
	
	ТаблицаЗагрузки.Очистить();
	
	Excel = Новый COMОбъект("Excel.Application");
	Excel.AutomationSecurity = 3;
	Excel.DisplayAlerts      = 0;
	
	Workbook = Excel.workbooks.Open(ФайлЗагрузки);
	
	Sheet = Workbook.Worksheets(1);
	
	Для НомерСтроки = 2 По Sheet.UsedRange.Rows.Count Цикл
		
		Если Не ЗначениеЗаполнено(Sheet.Cells(НомерСтроки, 1).Value) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаЗагрузки = ТаблицаЗагрузки.Добавить();		
		СтрокаЗагрузки.НомерПорядковый = СокрЛП(Sheet.Cells(НомерСтроки, 1).Value);
		СтрокаЗагрузки.НомерНакладной = СокрЛП(Sheet.Cells(НомерСтроки, 2).Value);
		СтрокаЗагрузки.Дата = Sheet.Cells(НомерСтроки, 3).Value;
		СтрокаЗагрузки.Клиент = Sheet.Cells(НомерСтроки, 4).Value;
		СтрокаЗагрузки.РННКлиента = СокрЛП(Sheet.Cells(НомерСтроки, 5).Value);
		Если ПустаяСтрока(СтрокаЗагрузки.РННКлиента) Тогда
			СтрокаЗагрузки.РННКлиента = "-";	
		КонецЕсли;
		СтрокаЗагрузки.ПинКодТМЦ = СокрЛП(Sheet.Cells(НомерСтроки, 6).Value);
		СтрокаЗагрузки.Наименование = Sheet.Cells(НомерСтроки, 7).Value;
		СтрокаЗагрузки.ЕдИзм = Sheet.Cells(НомерСтроки, 8).Value;
		СтрокаЗагрузки.Количество = ПривестиСтрокуКЧислу(Sheet.Cells(НомерСтроки, 9).Value);
		СтрокаЗагрузки.Цена = ПривестиСтрокуКЧислу(Sheet.Cells(НомерСтроки, 10).Value);
		СтрокаЗагрузки.Адрес = Sheet.Cells(НомерСтроки, 11).Value;
		СтрокаЗагрузки.Примечание = Sheet.Cells(НомерСтроки, 12).Value;
		СтрокаЗагрузки.ЗаНал = Sheet.Cells(НомерСтроки, 13).Value;
		СтрокаЗагрузки.Списание = Sheet.Cells(НомерСтроки, 14).Value;
		СтрокаЗагрузки.Машина = Sheet.Cells(НомерСтроки, 15).Value;
		СтрокаЗагрузки.Отвественный = Sheet.Cells(НомерСтроки, 16).Value;
		
	КонецЦикла;
	
	Excel.Quit();
	Excel = 0;
	
	ЗаполнитьТаблицуСопоставлениеми();

КонецПроцедуры

Процедура ЗаполнитьТаблицуСопоставлениеми()
	              	
	//Номенклатура
	Запрос = Новый Запрос;
	
	Запрос.Текст =     "ВЫБРАТЬ
		|	ТаблицаНоменклатура.ПинКодТМЦ
		|ПОМЕСТИТЬ ВТНоменклатура
		|ИЗ
		|	&ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		| ВЫБРАТЬ
	 	|	Номенклатура.Ссылка,
	 	|	Номенклатура.Штрихкод,  
		|	ВТНоменклатура.ПинКодТМЦ
		|ИЗ  
		|	ВТНоменклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	 	|	Справочник.Номенклатура КАК Номенклатура
		| ПО ВТНоменклатура.ПинКодТМЦ = Номенклатура.Штрихкод";


	Запрос.УстановитьПараметр("ТаблицаНоменклатура", ТаблицаЗагрузки);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("ПинКодТМЦ", Выборка.ПинКодТМЦ);
			
			МассивСтрок = ТаблицаЗагрузки.НайтиСтроки(СтруктураОтбора);
			
			Для Каждого Строка Из МассивСтрок Цикл
				Строка.Номенклатура = Выборка.Ссылка;	
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	//Партнеры
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаНоменклатура.РННКлиента
		|ПОМЕСТИТЬ ВТПартнеры
		|ИЗ
		|	&ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПартнеры.РННКлиента,
		|	Контрагенты.Ссылка
		|ИЗ
		|	ВТПартнеры КАК ВТПартнеры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО ВТПартнеры.РННКлиента = Контрагенты.ИНН";
	
	Запрос.УстановитьПараметр("ТаблицаНоменклатура", ТаблицаЗагрузки);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("РННКлиента", Выборка.РННКлиента);
			
			МассивСтрок = ТаблицаЗагрузки.НайтиСтроки(СтруктураОтбора);
			
			Для Каждого Строка Из МассивСтрок Цикл
				Строка.Контрагент = Выборка.Ссылка;	
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

Функция ПривестиСтрокуКЧислу(ЧислоСтрокой)
	
	СтрокаБезСимволаВалюты = СтрЗаменить(Строка(ЧислоСтрокой), "С", "");
	
	СтрокаБезНеразрывногоПробела = СтрЗаменить(СтрокаБезСимволаВалюты, Символы.НПП, "");
	СтроковоеПредставление = СтрЗаменить(Строка(СтрокаБезНеразрывногоПробела), " ", "");
	
	ОписаниеТипаЧисла = Новый ОписаниеТипов("Число");
	ЗначениеЧисла = ОписаниеТипаЧисла.ПривестиЗначение(СтроковоеПредставление);
	
	Возврат ЗначениеЧисла;    

КонецФункции


Процедура СформироватьДокументы() Экспорт
	
	ОчиститьСообщения();      
	
	Если Договор="Бонус" Тогда
		ПроверитьНаличиеБонусныхДоговоров(ТаблицаЗагрузки); 
	КонецЕсли;
	
	Если ЕстьОшибкиВТаблице() Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЕстьОшибкиВНастройках() Тогда
		Возврат;
	КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаЗагрузки.НомерНакладной,
		|	ТаблицаЗагрузки.Контрагент,
		|	ТаблицаЗагрузки.Номенклатура,
		|	ТаблицаЗагрузки.Количество,
		|	ТаблицаЗагрузки.Цена,
		|	ТаблицаЗагрузки.Адрес,
		|	ТаблицаЗагрузки.Примечание,
		|	ТаблицаЗагрузки.ЗаНал,
		|	ТаблицаЗагрузки.Машина,
		|	ТаблицаЗагрузки.Отвественный,
		|	ТаблицаЗагрузки.ДокументРеализации
		|ПОМЕСТИТЬ ВТТаблицаЗагрузки
		|ИЗ
		|	&ТаблицаЗагрузки КАК ТаблицаЗагрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТаблицаЗагрузки.НомерНакладной КАК НомерНакладной,
		|	ВТТаблицаЗагрузки.Контрагент КАК Контрагент,
		|	ВТТаблицаЗагрузки.Номенклатура,
		|	ВТТаблицаЗагрузки.Количество,
		|	ВТТаблицаЗагрузки.Цена,
		|	ВТТаблицаЗагрузки.Адрес КАК Адрес,
		|	ВТТаблицаЗагрузки.Примечание КАК Примечание,
		|	ВТТаблицаЗагрузки.ЗаНал КАК ЗаНал,
		|	ВТТаблицаЗагрузки.Машина КАК Машина,
		|	ВТТаблицаЗагрузки.Отвественный КАК Отвественный,
		|	ВТТаблицаЗагрузки.ДокументРеализации КАК ДокументРеализации,
		|	Контрагенты.ОсновнойДоговорКонтрагента КАК ОсновнойДоговорКонтрагента
		|ИЗ
		|	ВТТаблицаЗагрузки КАК ВТТаблицаЗагрузки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО ВТТаблицаЗагрузки.Контрагент = Контрагенты.Ссылка
		|ИТОГИ
		|	МАКСИМУМ(Контрагент),
		|	МАКСИМУМ(Адрес),
		|	МАКСИМУМ(Примечание),
		|	МАКСИМУМ(ЗаНал),
		|	МАКСИМУМ(Машина),
		|	МАКСИМУМ(Отвественный),
		|	МАКСИМУМ(ДокументРеализации),
		|	МАКСИМУМ(ОсновнойДоговорКонтрагента)
		|ПО
		|	НомерНакладной";
	
	Запрос.УстановитьПараметр("ТаблицаЗагрузки", ТаблицаЗагрузки);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНомерДокумента = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если Не ЗначениеЗаполнено(ПолеДата) Тогда
		ПолеДата = ТекущаяДата();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Склад) Тогда
		Сообщить("Не найден склад с кодом <000000002>");
		Возврат;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Сообщить("Не найдена организация с кодом <000000001>");
		Возврат;	
	КонецЕсли;
	
	Пока ВыборкаНомерДокумента.Следующий() Цикл
		//Создаем документ 
		Если ЗначениеЗаполнено(ВыборкаНомерДокумента.ДокументРеализации) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		ДокументОбъект.Дата = ПолеДата;
		ДокументОбъект.Организация = Организация;
		ДокументОбъект.Склад = Склад;         
		ДокументОбъект.ОтражатьВНалоговомУчете = Истина;
		ДокументОбъект.УчитыватьНДС = Ложь;
		ДокументОбъект.СуммаВключаетНДС = Истина;    
		ДокументОбъект.БезналичныйРасчет = Не Нал;
		
		ДокументОбъект.СчетУчетаРасчетовСКонтрагентом=ПланыСчетов.Типовой.СчетаКПолучениюЗаТоварыУслуги;
		ДокументОбъект.СчетУчетаРасчетовПоАвансам = ПланыСчетов.Типовой.АвансыПокупателейИЗаказчиков;	 
        
		ДокументОбъект.ДоговорКонтрагента = ОбработкаДоговора(ВыборкаНомерДокумента.Контрагент,Договор,ВыборкаНомерДокумента.ОсновнойДоговорКонтрагента);
		
		ДокументОбъект.Контрагент = ВыборкаНомерДокумента.Контрагент;
		
		
		ДокументОбъект.ТипЦен = ДокументОбъект.ДоговорКонтрагента.ТипЦен;
		ДокументОбъект.ВалютаДокумента = Валюта;
		ДокументОбъект.КурсВзаиморасчетов = 1;
		ДокументОбъект.КратностьВзаиморасчетов = 1;
		
		ДокументОбъект.Комментарий = ВыборкаНомерДокумента.НомерНакладной;   
		
		ДокументОбъект.ТипПоставкиСФ = ТипПоставки;
		ДокументОбъект.ВидПлатежа = ВидПлатежа;
		ДокументОбъект.БанковскийСчет = РасчетныйСчет; 
		ДокументОбъект.ВидПоставкиНДС = ВидНдс;
		
		ВыборкаТабЧасть = ВыборкаНомерДокумента.Выбрать();
		Пока ВыборкаТабЧасть.Следующий() Цикл
			//Заполняем таб. часть
				
			СтрокаТовары = ДокументОбъект.Товары.Добавить();
			СтрокаТовары.Номенклатура = ВыборкаТабЧасть.Номенклатура;
			СтрокаТовары.Количество = ВыборкаТабЧасть.Количество;
			СтрокаТовары.Коэффициент = 1;                                
	
			СтрокаТовары.ЕдиницаИзмерения = ВыборкаТабЧасть.Номенклатура.БазоваяЕдиницаИзмерения;
			СтрокаТовары.Цена = ВыборкаТабЧасть.Цена;     
			
			//----- Различные константы ----
			СтрокаТовары.СтавкаНСП = СтавкаНСП.Владелец;  
			СтрокаТовары.СчетУчетаБУ = ПланыСчетов.Типовой.Товары;
			СтрокаТовары.СчетДоходовНУ = ПланыСчетов.Налоговый.ДоходОтРеализацииТоваровРаботУслуг;
			СтрокаТовары.СчетДоходовБУ = ПланыСчетов.Типовой.Товары; 
			СтрокаТовары.СчетСписанияСебестоимостиБУ = ПланыСчетов.Типовой.ЗатратыНаСырьеИМатериалы; 
			СтрокаТовары.СтавкаНДС = СтавкаНДС;
			СтрокаТовары.СчетУчетаНДСПоРеализации = ПланыСчетов.Типовой.НДСКОплате;    
			СтрокаТовары.СтавкаНСП = СтавкаНСП; 
			СтрокаТовары.СчетУчетаНРТ =   ПланыСчетов.Типовой.НалогСПродаж;
			
			//---- Пересчет итогов --------
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТовары, ДокументОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТовары, ДокументОбъект,ДокументОбъект.ДоговорКонтрагента);  
									
		КонецЦикла;       
		ДокументОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ДокументОбъект.СуммаДокумента = УчетНДС.ПолучитьСуммуДокументаСНДС(ДокументОбъект, "Товары") + УчетНДС.ПолучитьСуммуДокументаСНДС(ДокументОбъект, "Услуги");
		НетОшибок = ДокументОбъект.ПроверитьЗаполнение(); 
		
		Попытка	
			
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("НомерНакладной", ВыборкаНомерДокумента.НомерНакладной);
		
		МассивСтрок = ТаблицаЗагрузки.НайтиСтроки(СтруктураОтбора);
		
		Для Каждого Строка Из МассивСтрок Цикл
			
			Строка.ДокументРеализации = ДокументОбъект.Ссылка;
			
		КонецЦикла;   
		
				
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;    
	Предупреждение("Выполнено!",3,"Загрузка реализаций");
	
КонецПроцедуры

Функция ЕстьОшибкиВТаблице()
	
	ЕстьОшибки = Ложь;
	
	Для Каждого Строка Из ТаблицаЗагрузки Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			Сообщить("Не заполнена номенклатура из базы! ПИН код ТМЦ: " + Строка.ПинКодТМЦ);
			ЕстьОшибки = Истина;
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(Строка.Контрагент) Тогда
			Сообщить("Не заполнен контрагент из базы! РНН Клиента: " + Строка.РННКлиента);
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Строка.Цена) Тогда
			Сообщить("Не заполнена цена в строке! №: " + Строка.НомерПорядковый);
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Строка.Количество) Тогда
			Сообщить("Не заполнено количество в строке! №: " + Строка.НомерПорядковый);
			ЕстьОшибки = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЕстьОшибки;
	
КонецФункции          

Функция ПроверитьНаличиеБонусныхДоговоров(ТаблицаКонтрагентов) Экспорт
	УникальныеКонтрагенты = Новый Соответствие;
	Ошибки = Новый СписокЗначений;

	Для Каждого Строка Из ТаблицаКонтрагентов Цикл
		Если НЕ ЗначениеЗаполнено(УникальныеКонтрагенты.Получить(Строка.Контрагент)) Тогда
			УникальныеКонтрагенты.Вставить(Строка.Контрагент, Строка.Контрагент);
		КонецЕсли;
	КонецЦикла;

	Для Каждого Контрагент Из УникальныеКонтрагенты Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|Договор.Наименование
		|ИЗ
		|Справочник.ДоговорыКонтрагентов КАК Договор
		|ГДЕ
		|Договор.Владелец = &Контрагент";

		Запрос.УстановитьПараметр("Контрагент", Контрагент.Значение);
		Результат = Запрос.Выполнить();
		
		ЕстьБонус = Ложь;
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() И НЕ ЕстьБонус Цикл
				Если ВРег(СокрЛП(Выборка.Наименование)) = ВРег("Бонус") Тогда
					ЕстьБонус = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		Если НЕ ЕстьБонус Тогда
			Ошибки.Добавить(Контрагент);
		КонецЕсли;
	КонецЦикла;

	Если Ошибки.Количество() > 0 Тогда
		Сообщение = "У следующих контрагентов отсутствует договор 'Бонус':";
		Для Каждого Контрагент Из Ошибки Цикл
			Сообщение = Сообщение + Символы.ПС + Контрагент;
		КонецЦикла;
		Сообщить(Сообщение);
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;
КонецФункции

Функция ОбработкаДоговора(Контрагент, ТипДоговора, ОсновнойДоговор) Экспорт
	Если ТипДоговора = "Бонус" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договор.Ссылка,
		|	Договор.Наименование
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК Договор
		|ГДЕ
		|	Договор.Владелец = &Контрагент";

		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Результат = Запрос.Выполнить();

		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если ВРег(СокрЛП(Выборка.Наименование)) = ВРег("Бонус") Тогда
					Возврат Выборка.Ссылка;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	Возврат ОсновнойДоговор;
КонецФункции

Функция ЕстьОшибкиВНастройках()
	ЕстьОшибки = Ложь;   
	Если не ЗначениеЗаполнено(Организация) Тогда
		Сообщить("Не заполнены Настройки: Организация!");
		ЕстьОшибки=Истина;
	КонецЕсли;   
	
	Если не ЗначениеЗаполнено(Склад) Тогда
		Сообщить("Не заполнены Настройки: Склад!");
		ЕстьОшибки=Истина;
	КонецЕсли;  
	
	Если не ЗначениеЗаполнено(ТипПоставки) Тогда
		Сообщить("Не заполнены Настройки: Тип Поставки!");
		ЕстьОшибки=Истина;
	КонецЕсли;    
	
	Если не ЗначениеЗаполнено(ВидПлатежа) Тогда
		Сообщить("Не заполнены Настройки: Вид платежа!");
		ЕстьОшибки=Истина;
	КонецЕсли;

	Если не ЗначениеЗаполнено(РасчетныйСчет) Тогда
		Сообщить("Не заполнены Настройки: Расчетный счет!");
		ЕстьОшибки=Истина;
	КонецЕсли;

	Если не ЗначениеЗаполнено(ВидНдс) Тогда
		Сообщить("Не заполнены Настройки: Вид поставки НДС!");
		ЕстьОшибки=Истина;
	КонецЕсли;

	
	Возврат ЕстьОшибки;
КонецФункции


